Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum
The surface load unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.KG_M2
Kilogram per square meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.TON_M2
Ton per square meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.N_M2
Newton per square meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.DAN_M2
daNewton per square meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.KN_M2
kNewton per square meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.PSI
Lbf per square inch.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.PDF
Lbf per square feet.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.KSI
Kip per square inch.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.KSF
Kip per square feet.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitEnum.UNKNOWN
unknown unit.